import random

n = 3

for i in range(n + 1):
    if i == 1:
        print("***")
    if i == 2:
        print("**")
    if i == 3:
        print("*")
    continue
print()
print('__________________________________________________________________________')
# _______________________________________________________________

y=True
b=0
d=0
while True:
    a = random.randint(1, 9)
    x = random.randint(2, 10)
    if a < x:
        b = x
        break

while True:
    c = random.randint(1, 9)
    x = random.randint(2, 10)
    if c < x:
        d = x
        break
print('Строки', a,"-", b)    # Данный принт сделал для себя, когда пытался разобраться как работает код
print('Столбцы', c,"-",d)   # и что нужно для правильной работы. Удалять не стал.
print()

print(end='\t')
for i in range(c, d+1):
    print(i, end='\t')
print()
for i in range(a, b+1):
    print(i, end='\t')
    for j in range(c, d+ 1):
        print(i*j, end='\t')
    print()


print('____________________________________________________________________________')

#__________________________________________________________________________________________________

print("Определите вид треугольника по длине трёх его сторон")
print()
a = int(input("Введите сторону 'a' треугольника: "))
b = int(input("Введите сторону 'b' треугольника: "))
c = int(input("Введите сторону 'c' треугольника: "))
print()


def type_of_triangle(a, b, c):
    if a == b == c:
        print("Равносторонний треугольник")
    elif a == b != c or a == c != b or b == c != a:
        print("Равнобедренный треугольник")
    else:
        print("Разносторонний треугольник")


type_of_triangle(a, b, c)

print('______________________________________________________________________')

#_____________________________________________________________________________________

print("Найдите среднее значение трёх положительных чисел")
print()
a = int(input("Введите первое число > 0: "))
b = int(input("Введите второе число > 0: "))
c = int(input("Введите третье число > 0: "))
print()
if a > 0 and b > 0 and c > 0:
    print("Среднее значение: ", (a + b + c) / 3)
else:
    print("Вы ввели число < 0. Попробуте снова.")

print('______________________________________________________________________')


#_______________________________________________________________________________

print("Смешайте 2 основных цвета")

x = input("Введите первый основной цвет: ")
y = input("Введите второй остновной цвет: ")
a = "красный"
b = "синий"
c = "жёлтый"
print()

def mixed_color(x, y):
    if x + y == a + b or x + y == b + a:
        print("фиолетовый")
    elif x + y == a + c or x + y == c + a:
        print("оранжевый")
    elif x + y == b + c or x + y == c + b:
        print("зелёный")
    else:
        print(False)


mixed_color(x,y)



